## Use case # 1:  use prefix and name and none of the new variables

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.resource_group.ibm_resource_group.resource_group[0] will be created
  + resource "ibm_resource_group" "resource_group" {
      + created_at          = (known after apply)
      + crn                 = (known after apply)
      + default             = (known after apply)
      + id                  = (known after apply)
      + name                = "basic-slz-vpc-resource-group"
      + payment_methods_url = (known after apply)
      + quota_id            = (known after apply)
      + quota_url           = (known after apply)
      + resource_linkages   = (known after apply)
      + state               = (known after apply)
      + teams_url           = (known after apply)
      + updated_at          = (known after apply)
    }

  # module.slz_vpc.data.ibm_is_vpc_address_prefixes.get_address_prefixes will be read during apply
  # (config refers to values not yet known)
 <= data "ibm_is_vpc_address_prefixes" "get_address_prefixes" {
      + address_prefixes = (known after apply)
      + id               = (known after apply)
      + vpc              = (known after apply)
    }

  # module.slz_vpc.ibm_is_network_acl.network_acl["vpc-acl"] will be created
  + resource "ibm_is_network_acl" "network_acl" {
      + access_tags             = (known after apply)
      + crn                     = (known after apply)
      + id                      = (known after apply)
      + name                    = "basic-slz-vpc-vpc-vpc-acl"
      + resource_controller_url = (known after apply)
      + resource_crn            = (known after apply)
      + resource_group          = (known after apply)
      + resource_group_name     = (known after apply)
      + resource_name           = (known after apply)
      + tags                    = (known after apply)
      + vpc                     = (known after apply)
    }

  # module.slz_vpc.ibm_is_public_gateway.gateway["zone-1"] will be created
  + resource "ibm_is_public_gateway" "gateway" {
      + access_tags             = (known after apply)
      + crn                     = (known after apply)
      + floating_ip             = (known after apply)
      + id                      = (known after apply)
      + name                    = "basic-slz-vpc-vpc-public-gateway-zone-1"
      + resource_controller_url = (known after apply)
      + resource_crn            = (known after apply)
      + resource_group          = (known after apply)
      + resource_group_name     = (known after apply)
      + resource_name           = (known after apply)
      + resource_status         = (known after apply)
      + status                  = (known after apply)
      + tags                    = (known after apply)
      + vpc                     = (known after apply)
      + zone                    = "us-south-1"
    }

  # module.slz_vpc.ibm_is_subnet.subnet["basic-slz-vpc-vpc-subnet-a"] will be created
  + resource "ibm_is_subnet" "subnet" {
      + access_tags                  = (known after apply)
      + available_ipv4_address_count = (known after apply)
      + crn                          = (known after apply)
      + id                           = (known after apply)
      + ip_version                   = "ipv4"
      + ipv4_cidr_block              = "10.10.10.0/24"
      + name                         = "basic-slz-vpc-vpc-subnet-a"
      + network_acl                  = (known after apply)
      + public_gateway               = (known after apply)
      + resource_controller_url      = (known after apply)
      + resource_crn                 = (known after apply)
      + resource_group               = (known after apply)
      + resource_group_name          = (known after apply)
      + resource_name                = (known after apply)
      + resource_status              = (known after apply)
      + routing_table                = (known after apply)
      + status                       = (known after apply)
      + tags                         = (known after apply)
      + total_ipv4_address_count     = (known after apply)
      + vpc                          = (known after apply)
      + zone                         = "us-south-1"
    }

  # module.slz_vpc.ibm_is_vpc.vpc[0] will be created
  + resource "ibm_is_vpc" "vpc" {
      + access_tags                 = (known after apply)
      + address_prefix_management   = "manual"
      + classic_access              = false
      + crn                         = (known after apply)
      + cse_source_addresses        = (known after apply)
      + default_network_acl         = (known after apply)
      + default_network_acl_crn     = (known after apply)
      + default_network_acl_name    = (known after apply)
      + default_routing_table       = (known after apply)
      + default_routing_table_name  = (known after apply)
      + default_security_group      = (known after apply)
      + default_security_group_crn  = (known after apply)
      + default_security_group_name = (known after apply)
      + health_reasons              = (known after apply)
      + health_state                = (known after apply)
      + id                          = (known after apply)
      + name                        = "basic-slz-vpc-vpc-vpc"
      + no_sg_acl_rules             = false
      + resource_controller_url     = (known after apply)
      + resource_crn                = (known after apply)
      + resource_group              = (known after apply)
      + resource_group_name         = (known after apply)
      + resource_name               = (known after apply)
      + resource_status             = (known after apply)
      + security_group              = (known after apply)
      + status                      = (known after apply)
      + subnets                     = (known after apply)
      + tags                        = (known after apply)

      + dns {
          + enable_hub               = false
          + resolution_binding_count = (known after apply)
        }
    }

  # module.slz_vpc.ibm_is_vpc_address_prefix.subnet_prefix["basic-slz-vpc-vpc-subnet-a"] will be created
  + resource "ibm_is_vpc_address_prefix" "subnet_prefix" {
      + address_prefix = (known after apply)
      + cidr           = "10.10.10.0/24"
      + has_subnets    = (known after apply)
      + id             = (known after apply)
      + is_default     = false
      + name           = "basic-slz-vpc-vpc-subnet-a"
      + related_crn    = (known after apply)
      + vpc            = (known after apply)
      + zone           = "us-south-1"
    }

Plan: 6 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + vpc_crn = (known after apply)
  + vpc_id  = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```
## Use case # 2: use name only (no prefix, none of the new variable)
```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.resource_group.ibm_resource_group.resource_group[0] will be created
  + resource "ibm_resource_group" "resource_group" {
      + created_at          = (known after apply)
      + crn                 = (known after apply)
      + default             = (known after apply)
      + id                  = (known after apply)
      + name                = "basic-slz-vpc-resource-group"
      + payment_methods_url = (known after apply)
      + quota_id            = (known after apply)
      + quota_url           = (known after apply)
      + resource_linkages   = (known after apply)
      + state               = (known after apply)
      + teams_url           = (known after apply)
      + updated_at          = (known after apply)
    }

  # module.slz_vpc.data.ibm_is_vpc_address_prefixes.get_address_prefixes will be read during apply
  # (config refers to values not yet known)
 <= data "ibm_is_vpc_address_prefixes" "get_address_prefixes" {
      + address_prefixes = (known after apply)
      + id               = (known after apply)
      + vpc              = (known after apply)
    }

  # module.slz_vpc.ibm_is_network_acl.network_acl["vpc-acl"] will be created
  + resource "ibm_is_network_acl" "network_acl" {
      + access_tags             = (known after apply)
      + crn                     = (known after apply)
      + id                      = (known after apply)
      + name                    = "vpc-vpc-acl"
      + resource_controller_url = (known after apply)
      + resource_crn            = (known after apply)
      + resource_group          = (known after apply)
      + resource_group_name     = (known after apply)
      + resource_name           = (known after apply)
      + tags                    = (known after apply)
      + vpc                     = (known after apply)
    }

  # module.slz_vpc.ibm_is_public_gateway.gateway["zone-1"] will be created
  + resource "ibm_is_public_gateway" "gateway" {
      + access_tags             = (known after apply)
      + crn                     = (known after apply)
      + floating_ip             = (known after apply)
      + id                      = (known after apply)
      + name                    = "vpc-public-gateway-zone-1"
      + resource_controller_url = (known after apply)
      + resource_crn            = (known after apply)
      + resource_group          = (known after apply)
      + resource_group_name     = (known after apply)
      + resource_name           = (known after apply)
      + resource_status         = (known after apply)
      + status                  = (known after apply)
      + tags                    = (known after apply)
      + vpc                     = (known after apply)
      + zone                    = "us-south-1"
    }

  # module.slz_vpc.ibm_is_subnet.subnet["vpc-subnet-a"] will be created
  + resource "ibm_is_subnet" "subnet" {
      + access_tags                  = (known after apply)
      + available_ipv4_address_count = (known after apply)
      + crn                          = (known after apply)
      + id                           = (known after apply)
      + ip_version                   = "ipv4"
      + ipv4_cidr_block              = "10.10.10.0/24"
      + name                         = "vpc-subnet-a"
      + network_acl                  = (known after apply)
      + public_gateway               = (known after apply)
      + resource_controller_url      = (known after apply)
      + resource_crn                 = (known after apply)
      + resource_group               = (known after apply)
      + resource_group_name          = (known after apply)
      + resource_name                = (known after apply)
      + resource_status              = (known after apply)
      + routing_table                = (known after apply)
      + status                       = (known after apply)
      + tags                         = (known after apply)
      + total_ipv4_address_count     = (known after apply)
      + vpc                          = (known after apply)
      + zone                         = "us-south-1"
    }

  # module.slz_vpc.ibm_is_vpc.vpc[0] will be created
  + resource "ibm_is_vpc" "vpc" {
      + access_tags                 = (known after apply)
      + address_prefix_management   = "manual"
      + classic_access              = false
      + crn                         = (known after apply)
      + cse_source_addresses        = (known after apply)
      + default_network_acl         = (known after apply)
      + default_network_acl_crn     = (known after apply)
      + default_network_acl_name    = (known after apply)
      + default_routing_table       = (known after apply)
      + default_routing_table_name  = (known after apply)
      + default_security_group      = (known after apply)
      + default_security_group_crn  = (known after apply)
      + default_security_group_name = (known after apply)
      + health_reasons              = (known after apply)
      + health_state                = (known after apply)
      + id                          = (known after apply)
      + name                        = "vpc"
      + no_sg_acl_rules             = false
      + resource_controller_url     = (known after apply)
      + resource_crn                = (known after apply)
      + resource_group              = (known after apply)
      + resource_group_name         = (known after apply)
      + resource_name               = (known after apply)
      + resource_status             = (known after apply)
      + security_group              = (known after apply)
      + status                      = (known after apply)
      + subnets                     = (known after apply)
      + tags                        = (known after apply)

      + dns {
          + enable_hub               = false
          + resolution_binding_count = (known after apply)
        }
    }

  # module.slz_vpc.ibm_is_vpc_address_prefix.subnet_prefix["vpc-subnet-a"] will be created
  + resource "ibm_is_vpc_address_prefix" "subnet_prefix" {
      + address_prefix = (known after apply)
      + cidr           = "10.10.10.0/24"
      + has_subnets    = (known after apply)
      + id             = (known after apply)
      + is_default     = false
      + name           = "vpc-subnet-a"
      + related_crn    = (known after apply)
      + vpc            = (known after apply)
      + zone           = "us-south-1"
    }

Plan: 6 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + vpc_crn = (known after apply)
  + vpc_id  = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

## Use case # 3: set a value for name, prefix and use all of the new variables. 
```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # ibm_cos_bucket.cos_bucket will be created
  + resource "ibm_cos_bucket" "cos_bucket" {
      + bucket_name          = "vpc-logs-cos-bucket"
      + crn                  = (known after apply)
      + endpoint_type        = "public"
      + force_delete         = true
      + id                   = (known after apply)
      + region_location      = "us-south"
      + resource_instance_id = (known after apply)
      + s3_endpoint_direct   = (known after apply)
      + s3_endpoint_private  = (known after apply)
      + s3_endpoint_public   = (known after apply)
      + storage_class        = "standard"
    }

  # ibm_resource_instance.cos_instance will be created
  + resource "ibm_resource_instance" "cos_instance" {
      + account_id              = (known after apply)
      + allow_cleanup           = (known after apply)
      + created_at              = (known after apply)
      + created_by              = (known after apply)
      + crn                     = (known after apply)
      + dashboard_url           = (known after apply)
      + deleted_at              = (known after apply)
      + deleted_by              = (known after apply)
      + extensions              = (known after apply)
      + guid                    = (known after apply)
      + id                      = (known after apply)
      + last_operation          = (known after apply)
      + location                = "global"
      + locked                  = (known after apply)
      + name                    = "vpc-logs-cos"
      + plan                    = "standard"
      + plan_history            = (known after apply)
      + resource_aliases_url    = (known after apply)
      + resource_bindings_url   = (known after apply)
      + resource_controller_url = (known after apply)
      + resource_crn            = (known after apply)
      + resource_group_crn      = (known after apply)
      + resource_group_id       = (known after apply)
      + resource_group_name     = (known after apply)
      + resource_id             = (known after apply)
      + resource_keys_url       = (known after apply)
      + resource_name           = (known after apply)
      + resource_plan_id        = (known after apply)
      + resource_status         = (known after apply)
      + restored_at             = (known after apply)
      + restored_by             = (known after apply)
      + scheduled_reclaim_at    = (known after apply)
      + scheduled_reclaim_by    = (known after apply)
      + service                 = "cloud-object-storage"
      + service_endpoints       = (known after apply)
      + state                   = (known after apply)
      + status                  = (known after apply)
      + sub_type                = (known after apply)
      + tags                    = (known after apply)
      + target_crn              = (known after apply)
      + type                    = (known after apply)
      + update_at               = (known after apply)
      + update_by               = (known after apply)
    }

  # module.hub_vpc.data.ibm_is_vpc_address_prefixes.get_address_prefixes will be read during apply
  # (config refers to values not yet known)
 <= data "ibm_is_vpc_address_prefixes" "get_address_prefixes" {
      + address_prefixes = (known after apply)
      + id               = (known after apply)
      + vpc              = (known after apply)
    }

  # module.hub_vpc.ibm_dns_custom_resolver.custom_resolver_hub[0] will be created
  + resource "ibm_dns_custom_resolver" "custom_resolver_hub" {
      + created_on         = (known after apply)
      + custom_resolver_id = (known after apply)
      + enabled            = true
      + health             = (known after apply)
      + high_availability  = true
      + id                 = (known after apply)
      + instance_id        = (known after apply)
      + modified_on        = (known after apply)
      + name               = "dns-custom-resolver-name"
      + rules              = (known after apply)

      + locations {
          + dns_server_ip = (known after apply)
          + enabled       = true
          + healthy       = (known after apply)
          + location_id   = (known after apply)
          + subnet_crn    = (known after apply)
        }
      + locations {
          + dns_server_ip = (known after apply)
          + enabled       = true
          + healthy       = (known after apply)
          + location_id   = (known after apply)
          + subnet_crn    = (known after apply)
        }
      + locations {
          + dns_server_ip = (known after apply)
          + enabled       = true
          + healthy       = (known after apply)
          + location_id   = (known after apply)
          + subnet_crn    = (known after apply)
        }
    }

  # module.hub_vpc.ibm_is_flow_log.flow_logs[0] will be created
  + resource "ibm_is_flow_log" "flow_logs" {
      + access_tags             = (known after apply)
      + active                  = true
      + auto_delete             = (known after apply)
      + created_at              = (known after apply)
      + crn                     = (known after apply)
      + href                    = (known after apply)
      + id                      = (known after apply)
      + lifecycle_state         = (known after apply)
      + name                    = "vpc-flow-logs"
      + resource_controller_url = (known after apply)
      + resource_crn            = (known after apply)
      + resource_group          = (known after apply)
      + resource_group_name     = (known after apply)
      + resource_name           = (known after apply)
      + resource_status         = (known after apply)
      + storage_bucket          = "vpc-logs-cos-bucket"
      + tags                    = (known after apply)
      + target                  = (known after apply)
      + vpc                     = (known after apply)
    }

  # module.hub_vpc.ibm_is_network_acl.network_acl["vpc-acl"] will be created
  + resource "ibm_is_network_acl" "network_acl" {
      + access_tags             = (known after apply)
      + crn                     = (known after apply)
      + id                      = (known after apply)
      + name                    = "hs-delegated-hub-hub-vpc-acl"
      + resource_controller_url = (known after apply)
      + resource_crn            = (known after apply)
      + resource_group          = (known after apply)
      + resource_group_name     = (known after apply)
      + resource_name           = (known after apply)
      + tags                    = (known after apply)
      + vpc                     = (known after apply)
    }

  # module.hub_vpc.ibm_is_public_gateway.gateway["zone-1"] will be created
  + resource "ibm_is_public_gateway" "gateway" {
      + access_tags             = (known after apply)
      + crn                     = (known after apply)
      + floating_ip             = (known after apply)
      + id                      = (known after apply)
      + name                    = "public-gw-zone-1"
      + resource_controller_url = (known after apply)
      + resource_crn            = (known after apply)
      + resource_group          = (known after apply)
      + resource_group_name     = (known after apply)
      + resource_name           = (known after apply)
      + resource_status         = (known after apply)
      + status                  = (known after apply)
      + tags                    = (known after apply)
      + vpc                     = (known after apply)
      + zone                    = "us-south-1"
    }

  # module.hub_vpc.ibm_is_subnet.subnet["hs-delegated-hub-hub-subnet-a"] will be created
  + resource "ibm_is_subnet" "subnet" {
      + access_tags                  = (known after apply)
      + available_ipv4_address_count = (known after apply)
      + crn                          = (known after apply)
      + id                           = (known after apply)
      + ip_version                   = "ipv4"
      + ipv4_cidr_block              = "10.10.10.0/24"
      + name                         = "hs-delegated-hub-hub-subnet-a"
      + network_acl                  = (known after apply)
      + public_gateway               = (known after apply)
      + resource_controller_url      = (known after apply)
      + resource_crn                 = (known after apply)
      + resource_group               = (known after apply)
      + resource_group_name          = (known after apply)
      + resource_name                = (known after apply)
      + resource_status              = (known after apply)
      + routing_table                = (known after apply)
      + status                       = (known after apply)
      + tags                         = (known after apply)
      + total_ipv4_address_count     = (known after apply)
      + vpc                          = (known after apply)
      + zone                         = "us-south-1"
    }

  # module.hub_vpc.ibm_is_subnet.subnet["hs-delegated-hub-hub-subnet-b"] will be created
  + resource "ibm_is_subnet" "subnet" {
      + access_tags                  = (known after apply)
      + available_ipv4_address_count = (known after apply)
      + crn                          = (known after apply)
      + id                           = (known after apply)
      + ip_version                   = "ipv4"
      + ipv4_cidr_block              = "10.20.10.0/24"
      + name                         = "hs-delegated-hub-hub-subnet-b"
      + network_acl                  = (known after apply)
      + public_gateway               = (known after apply)
      + resource_controller_url      = (known after apply)
      + resource_crn                 = (known after apply)
      + resource_group               = (known after apply)
      + resource_group_name          = (known after apply)
      + resource_name                = (known after apply)
      + resource_status              = (known after apply)
      + routing_table                = (known after apply)
      + status                       = (known after apply)
      + tags                         = (known after apply)
      + total_ipv4_address_count     = (known after apply)
      + vpc                          = (known after apply)
      + zone                         = "us-south-2"
    }

  # module.hub_vpc.ibm_is_subnet.subnet["hs-delegated-hub-hub-subnet-c"] will be created
  + resource "ibm_is_subnet" "subnet" {
      + access_tags                  = (known after apply)
      + available_ipv4_address_count = (known after apply)
      + crn                          = (known after apply)
      + id                           = (known after apply)
      + ip_version                   = "ipv4"
      + ipv4_cidr_block              = "10.30.10.0/24"
      + name                         = "hs-delegated-hub-hub-subnet-c"
      + network_acl                  = (known after apply)
      + public_gateway               = (known after apply)
      + resource_controller_url      = (known after apply)
      + resource_crn                 = (known after apply)
      + resource_group               = (known after apply)
      + resource_group_name          = (known after apply)
      + resource_name                = (known after apply)
      + resource_status              = (known after apply)
      + routing_table                = (known after apply)
      + status                       = (known after apply)
      + tags                         = (known after apply)
      + total_ipv4_address_count     = (known after apply)
      + vpc                          = (known after apply)
      + zone                         = "us-south-3"
    }

  # module.hub_vpc.ibm_is_vpc.vpc[0] will be created
  + resource "ibm_is_vpc" "vpc" {
      + access_tags                 = (known after apply)
      + address_prefix_management   = "manual"
      + classic_access              = false
      + crn                         = (known after apply)
      + cse_source_addresses        = (known after apply)
      + default_network_acl         = (known after apply)
      + default_network_acl_crn     = (known after apply)
      + default_network_acl_name    = (known after apply)
      + default_routing_table       = (known after apply)
      + default_routing_table_name  = (known after apply)
      + default_security_group      = (known after apply)
      + default_security_group_crn  = (known after apply)
      + default_security_group_name = (known after apply)
      + health_reasons              = (known after apply)
      + health_state                = (known after apply)
      + id                          = (known after apply)
      + name                        = "hs-delegated-hub-hub-vpc"
      + no_sg_acl_rules             = false
      + resource_controller_url     = (known after apply)
      + resource_crn                = (known after apply)
      + resource_group              = (known after apply)
      + resource_group_name         = (known after apply)
      + resource_name               = (known after apply)
      + resource_status             = (known after apply)
      + security_group              = (known after apply)
      + status                      = (known after apply)
      + subnets                     = (known after apply)
      + tags                        = (known after apply)

      + dns {
          + enable_hub               = true
          + resolution_binding_count = (known after apply)
        }
    }

  # module.hub_vpc.ibm_is_vpc_address_prefix.subnet_prefix["hs-delegated-hub-hub-subnet-a"] will be created
  + resource "ibm_is_vpc_address_prefix" "subnet_prefix" {
      + address_prefix = (known after apply)
      + cidr           = "10.10.10.0/24"
      + has_subnets    = (known after apply)
      + id             = (known after apply)
      + is_default     = false
      + name           = "hs-delegated-hub-hub-subnet-a"
      + related_crn    = (known after apply)
      + vpc            = (known after apply)
      + zone           = "us-south-1"
    }

  # module.hub_vpc.ibm_is_vpc_address_prefix.subnet_prefix["hs-delegated-hub-hub-subnet-b"] will be created
  + resource "ibm_is_vpc_address_prefix" "subnet_prefix" {
      + address_prefix = (known after apply)
      + cidr           = "10.20.10.0/24"
      + has_subnets    = (known after apply)
      + id             = (known after apply)
      + is_default     = false
      + name           = "hs-delegated-hub-hub-subnet-b"
      + related_crn    = (known after apply)
      + vpc            = (known after apply)
      + zone           = "us-south-2"
    }

  # module.hub_vpc.ibm_is_vpc_address_prefix.subnet_prefix["hs-delegated-hub-hub-subnet-c"] will be created
  + resource "ibm_is_vpc_address_prefix" "subnet_prefix" {
      + address_prefix = (known after apply)
      + cidr           = "10.30.10.0/24"
      + has_subnets    = (known after apply)
      + id             = (known after apply)
      + is_default     = false
      + name           = "hs-delegated-hub-hub-subnet-c"
      + related_crn    = (known after apply)
      + vpc            = (known after apply)
      + zone           = "us-south-3"
    }

  # module.hub_vpc.ibm_resource_instance.dns_instance_hub[0] will be created
  + resource "ibm_resource_instance" "dns_instance_hub" {
      + account_id              = (known after apply)
      + allow_cleanup           = (known after apply)
      + created_at              = (known after apply)
      + created_by              = (known after apply)
      + crn                     = (known after apply)
      + dashboard_url           = (known after apply)
      + deleted_at              = (known after apply)
      + deleted_by              = (known after apply)
      + extensions              = (known after apply)
      + guid                    = (known after apply)
      + id                      = (known after apply)
      + last_operation          = (known after apply)
      + location                = "global"
      + locked                  = (known after apply)
      + name                    = "dns-instance-name"
      + plan                    = "standard-dns"
      + plan_history            = (known after apply)
      + resource_aliases_url    = (known after apply)
      + resource_bindings_url   = (known after apply)
      + resource_controller_url = (known after apply)
      + resource_crn            = (known after apply)
      + resource_group_crn      = (known after apply)
      + resource_group_id       = (known after apply)
      + resource_group_name     = (known after apply)
      + resource_id             = (known after apply)
      + resource_keys_url       = (known after apply)
      + resource_name           = (known after apply)
      + resource_plan_id        = (known after apply)
      + resource_status         = (known after apply)
      + restored_at             = (known after apply)
      + restored_by             = (known after apply)
      + scheduled_reclaim_at    = (known after apply)
      + scheduled_reclaim_by    = (known after apply)
      + service                 = "dns-svcs"
      + service_endpoints       = (known after apply)
      + state                   = (known after apply)
      + status                  = (known after apply)
      + sub_type                = (known after apply)
      + tags                    = (known after apply)
      + target_crn              = (known after apply)
      + type                    = (known after apply)
      + update_at               = (known after apply)
      + update_by               = (known after apply)
    }

  # module.resource_group.ibm_resource_group.resource_group[0] will be created
  + resource "ibm_resource_group" "resource_group" {
      + created_at          = (known after apply)
      + crn                 = (known after apply)
      + default             = (known after apply)
      + id                  = (known after apply)
      + name                = "hs-delegated-resource-group"
      + payment_methods_url = (known after apply)
      + quota_id            = (known after apply)
      + quota_url           = (known after apply)
      + resource_linkages   = (known after apply)
      + state               = (known after apply)
      + teams_url           = (known after apply)
      + updated_at          = (known after apply)
    }

  # module.spoke_vpc.data.ibm_is_vpc_address_prefixes.get_address_prefixes will be read during apply
  # (config refers to values not yet known)
 <= data "ibm_is_vpc_address_prefixes" "get_address_prefixes" {
      + address_prefixes = (known after apply)
      + id               = (known after apply)
      + vpc              = (known after apply)
    }

  # module.spoke_vpc.ibm_is_flow_log.flow_logs[0] will be created
  + resource "ibm_is_flow_log" "flow_logs" {
      + access_tags             = (known after apply)
      + active                  = true
      + auto_delete             = (known after apply)
      + created_at              = (known after apply)
      + crn                     = (known after apply)
      + href                    = (known after apply)
      + id                      = (known after apply)
      + lifecycle_state         = (known after apply)
      + name                    = "vpc-flow-logs"
      + resource_controller_url = (known after apply)
      + resource_crn            = (known after apply)
      + resource_group          = (known after apply)
      + resource_group_name     = (known after apply)
      + resource_name           = (known after apply)
      + resource_status         = (known after apply)
      + storage_bucket          = "vpc-logs-cos-bucket"
      + tags                    = (known after apply)
      + target                  = (known after apply)
      + vpc                     = (known after apply)
    }

  # module.spoke_vpc.ibm_is_network_acl.network_acl["vpc-acl"] will be created
  + resource "ibm_is_network_acl" "network_acl" {
      + access_tags             = (known after apply)
      + crn                     = (known after apply)
      + id                      = (known after apply)
      + name                    = "hs-delegated-spoke-spoke-vpc-acl"
      + resource_controller_url = (known after apply)
      + resource_crn            = (known after apply)
      + resource_group          = (known after apply)
      + resource_group_name     = (known after apply)
      + resource_name           = (known after apply)
      + tags                    = (known after apply)
      + vpc                     = (known after apply)
    }

  # module.spoke_vpc.ibm_is_public_gateway.gateway["zone-1"] will be created
  + resource "ibm_is_public_gateway" "gateway" {
      + access_tags             = (known after apply)
      + crn                     = (known after apply)
      + floating_ip             = (known after apply)
      + id                      = (known after apply)
      + name                    = "public-gw-zone-1"
      + resource_controller_url = (known after apply)
      + resource_crn            = (known after apply)
      + resource_group          = (known after apply)
      + resource_group_name     = (known after apply)
      + resource_name           = (known after apply)
      + resource_status         = (known after apply)
      + status                  = (known after apply)
      + tags                    = (known after apply)
      + vpc                     = (known after apply)
      + zone                    = "us-south-1"
    }

  # module.spoke_vpc.ibm_is_subnet.subnet["hs-delegated-spoke-spoke-subnet-a"] will be created
  + resource "ibm_is_subnet" "subnet" {
      + access_tags                  = (known after apply)
      + available_ipv4_address_count = (known after apply)
      + crn                          = (known after apply)
      + id                           = (known after apply)
      + ip_version                   = "ipv4"
      + ipv4_cidr_block              = "10.40.10.0/24"
      + name                         = "hs-delegated-spoke-spoke-subnet-a"
      + network_acl                  = (known after apply)
      + public_gateway               = (known after apply)
      + resource_controller_url      = (known after apply)
      + resource_crn                 = (known after apply)
      + resource_group               = (known after apply)
      + resource_group_name          = (known after apply)
      + resource_name                = (known after apply)
      + resource_status              = (known after apply)
      + routing_table                = (known after apply)
      + status                       = (known after apply)
      + tags                         = (known after apply)
      + total_ipv4_address_count     = (known after apply)
      + vpc                          = (known after apply)
      + zone                         = "us-south-1"
    }

  # module.spoke_vpc.ibm_is_subnet.subnet["hs-delegated-spoke-spoke-subnet-b"] will be created
  + resource "ibm_is_subnet" "subnet" {
      + access_tags                  = (known after apply)
      + available_ipv4_address_count = (known after apply)
      + crn                          = (known after apply)
      + id                           = (known after apply)
      + ip_version                   = "ipv4"
      + ipv4_cidr_block              = "10.50.10.0/24"
      + name                         = "hs-delegated-spoke-spoke-subnet-b"
      + network_acl                  = (known after apply)
      + public_gateway               = (known after apply)
      + resource_controller_url      = (known after apply)
      + resource_crn                 = (known after apply)
      + resource_group               = (known after apply)
      + resource_group_name          = (known after apply)
      + resource_name                = (known after apply)
      + resource_status              = (known after apply)
      + routing_table                = (known after apply)
      + status                       = (known after apply)
      + tags                         = (known after apply)
      + total_ipv4_address_count     = (known after apply)
      + vpc                          = (known after apply)
      + zone                         = "us-south-2"
    }

  # module.spoke_vpc.ibm_is_subnet.subnet["hs-delegated-spoke-spoke-subnet-c"] will be created
  + resource "ibm_is_subnet" "subnet" {
      + access_tags                  = (known after apply)
      + available_ipv4_address_count = (known after apply)
      + crn                          = (known after apply)
      + id                           = (known after apply)
      + ip_version                   = "ipv4"
      + ipv4_cidr_block              = "10.60.10.0/24"
      + name                         = "hs-delegated-spoke-spoke-subnet-c"
      + network_acl                  = (known after apply)
      + public_gateway               = (known after apply)
      + resource_controller_url      = (known after apply)
      + resource_crn                 = (known after apply)
      + resource_group               = (known after apply)
      + resource_group_name          = (known after apply)
      + resource_name                = (known after apply)
      + resource_status              = (known after apply)
      + routing_table                = (known after apply)
      + status                       = (known after apply)
      + tags                         = (known after apply)
      + total_ipv4_address_count     = (known after apply)
      + vpc                          = (known after apply)
      + zone                         = "us-south-3"
    }

  # module.spoke_vpc.ibm_is_vpc.vpc[0] will be created
  + resource "ibm_is_vpc" "vpc" {
      + access_tags                 = (known after apply)
      + address_prefix_management   = "manual"
      + classic_access              = false
      + crn                         = (known after apply)
      + cse_source_addresses        = (known after apply)
      + default_network_acl         = (known after apply)
      + default_network_acl_crn     = (known after apply)
      + default_network_acl_name    = (known after apply)
      + default_routing_table       = (known after apply)
      + default_routing_table_name  = (known after apply)
      + default_security_group      = (known after apply)
      + default_security_group_crn  = (known after apply)
      + default_security_group_name = (known after apply)
      + health_reasons              = (known after apply)
      + health_state                = (known after apply)
      + id                          = (known after apply)
      + name                        = "hs-delegated-spoke-spoke-vpc"
      + no_sg_acl_rules             = false
      + resource_controller_url     = (known after apply)
      + resource_crn                = (known after apply)
      + resource_group              = (known after apply)
      + resource_group_name         = (known after apply)
      + resource_name               = (known after apply)
      + resource_status             = (known after apply)
      + security_group              = (known after apply)
      + status                      = (known after apply)
      + subnets                     = (known after apply)
      + tags                        = (known after apply)

      + dns {
          + enable_hub               = false
          + resolution_binding_count = (known after apply)
        }
    }

  # module.spoke_vpc.ibm_is_vpc_address_prefix.subnet_prefix["hs-delegated-spoke-spoke-subnet-a"] will be created
  + resource "ibm_is_vpc_address_prefix" "subnet_prefix" {
      + address_prefix = (known after apply)
      + cidr           = "10.40.10.0/24"
      + has_subnets    = (known after apply)
      + id             = (known after apply)
      + is_default     = false
      + name           = "hs-delegated-spoke-spoke-subnet-a"
      + related_crn    = (known after apply)
      + vpc            = (known after apply)
      + zone           = "us-south-1"
    }

  # module.spoke_vpc.ibm_is_vpc_address_prefix.subnet_prefix["hs-delegated-spoke-spoke-subnet-b"] will be created
  + resource "ibm_is_vpc_address_prefix" "subnet_prefix" {
      + address_prefix = (known after apply)
      + cidr           = "10.50.10.0/24"
      + has_subnets    = (known after apply)
      + id             = (known after apply)
      + is_default     = false
      + name           = "hs-delegated-spoke-spoke-subnet-b"
      + related_crn    = (known after apply)
      + vpc            = (known after apply)
      + zone           = "us-south-2"
    }

  # module.spoke_vpc.ibm_is_vpc_address_prefix.subnet_prefix["hs-delegated-spoke-spoke-subnet-c"] will be created
  + resource "ibm_is_vpc_address_prefix" "subnet_prefix" {
      + address_prefix = (known after apply)
      + cidr           = "10.60.10.0/24"
      + has_subnets    = (known after apply)
      + id             = (known after apply)
      + is_default     = false
      + name           = "hs-delegated-spoke-spoke-subnet-c"
      + related_crn    = (known after apply)
      + vpc            = (known after apply)
      + zone           = "us-south-3"
    }

  # module.spoke_vpc.ibm_is_vpc_dns_resolution_binding.vpc_dns_resolution_binding_crn[0] will be created
  + resource "ibm_is_vpc_dns_resolution_binding" "vpc_dns_resolution_binding_crn" {
      + created_at        = (known after apply)
      + endpoint_gateways = (known after apply)
      + href              = (known after apply)
      + id                = (known after apply)
      + lifecycle_state   = (known after apply)
      + name              = "dns-binding-name"
      + resource_type     = (known after apply)
      + vpc_id            = (known after apply)

      + vpc {
          + crn           = (known after apply)
          + href          = (known after apply)
          + id            = (known after apply)
          + name          = (known after apply)
          + remote        = (known after apply)
          + resource_type = (known after apply)
        }
    }

  # module.tg_gateway_connection.ibm_tg_connection.vpc_connections[0] will be created
  + resource "ibm_tg_connection" "vpc_connections" {
      + base_connection_id = (known after apply)
      + base_network_type  = (known after apply)
      + connection_id      = (known after apply)
      + created_at         = (known after apply)
      + gateway            = (known after apply)
      + id                 = (known after apply)
      + local_gateway_ip   = (known after apply)
      + local_tunnel_ip    = (known after apply)
      + name               = "vpc_conn_inst0"
      + network_account_id = (known after apply)
      + network_id         = (known after apply)
      + network_type       = "vpc"
      + related_crn        = (known after apply)
      + remote_bgp_asn     = (known after apply)
      + remote_gateway_ip  = (known after apply)
      + remote_tunnel_ip   = (known after apply)
      + request_status     = (known after apply)
      + status             = (known after apply)
      + updated_at         = (known after apply)
      + zone               = (known after apply)
    }

  # module.tg_gateway_connection.ibm_tg_connection.vpc_connections[1] will be created
  + resource "ibm_tg_connection" "vpc_connections" {
      + base_connection_id = (known after apply)
      + base_network_type  = (known after apply)
      + connection_id      = (known after apply)
      + created_at         = (known after apply)
      + gateway            = (known after apply)
      + id                 = (known after apply)
      + local_gateway_ip   = (known after apply)
      + local_tunnel_ip    = (known after apply)
      + name               = "vpc_conn_inst1"
      + network_account_id = (known after apply)
      + network_id         = (known after apply)
      + network_type       = "vpc"
      + related_crn        = (known after apply)
      + remote_bgp_asn     = (known after apply)
      + remote_gateway_ip  = (known after apply)
      + remote_tunnel_ip   = (known after apply)
      + request_status     = (known after apply)
      + status             = (known after apply)
      + updated_at         = (known after apply)
      + zone               = (known after apply)
    }

  # module.tg_gateway_connection.ibm_tg_gateway.tg_gw_instance[0] will be created
  + resource "ibm_tg_gateway" "tg_gw_instance" {
      + created_at              = (known after apply)
      + crn                     = (known after apply)
      + global                  = false
      + id                      = (known after apply)
      + location                = "us-south"
      + name                    = "hs-delegated-tg"
      + resource_controller_url = (known after apply)
      + resource_crn            = (known after apply)
      + resource_group          = (known after apply)
      + resource_group_name     = (known after apply)
      + resource_name           = (known after apply)
      + resource_status         = (known after apply)
      + status                  = (known after apply)
      + tags                    = (known after apply)
      + updated_at              = (known after apply)

      + timeouts {
          + delete = "45m"
        }
    }

Plan: 29 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + custom_resolver_hub_vpc                = {
      + created_on         = (known after apply)
      + custom_resolver_id = (known after apply)
      + description        = null
      + enabled            = true
      + health             = (known after apply)
      + high_availability  = true
      + id                 = (known after apply)
      + instance_id        = (known after apply)
      + locations          = [
          + {
              + dns_server_ip = (known after apply)
              + enabled       = true
              + healthy       = (known after apply)
              + location_id   = (known after apply)
              + subnet_crn    = (known after apply)
            },
          + {
              + dns_server_ip = (known after apply)
              + enabled       = true
              + healthy       = (known after apply)
              + location_id   = (known after apply)
              + subnet_crn    = (known after apply)
            },
          + {
              + dns_server_ip = (known after apply)
              + enabled       = true
              + healthy       = (known after apply)
              + location_id   = (known after apply)
              + subnet_crn    = (known after apply)
            },
        ]
      + modified_on        = (known after apply)
      + name               = "dns-custom-resolver-name"
      + rules              = (known after apply)
      + timeouts           = null
    }
  + dns_endpoint_gateways_by_spoke_vpc_crn = {
      + created_at        = (known after apply)
      + endpoint_gateways = (known after apply)
      + href              = (known after apply)
      + id                = (known after apply)
      + lifecycle_state   = (known after apply)
      + name              = "dns-binding-name"
      + resource_type     = (known after apply)
      + vpc               = [
          + {
              + crn           = (known after apply)
              + href          = (known after apply)
              + id            = (known after apply)
              + name          = (known after apply)
              + remote        = (known after apply)
              + resource_type = (known after apply)
            },
        ]
      + vpc_id            = (known after apply)
    }
  + hub_vpc_crn                            = (known after apply)
  + hub_vpc_id                             = (known after apply)
  + spoke_vpc_crn                          = (known after apply)
  + spoke_vpc_id                           = (known after apply)
  + transit_gateway_crn                    = (known after apply)
  + transit_gateway_id                     = (known after apply)
  + vpc_connection_ids                     = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

## Use case # 4: set a value for name and use all of the new variables. Do not use prefix
```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # ibm_cos_bucket.cos_bucket will be created
  + resource "ibm_cos_bucket" "cos_bucket" {
      + bucket_name          = "vpc-logs-cos-bucket"
      + crn                  = (known after apply)
      + endpoint_type        = "public"
      + force_delete         = true
      + id                   = (known after apply)
      + region_location      = "us-south"
      + resource_instance_id = (known after apply)
      + s3_endpoint_direct   = (known after apply)
      + s3_endpoint_private  = (known after apply)
      + s3_endpoint_public   = (known after apply)
      + storage_class        = "standard"
    }

  # ibm_resource_instance.cos_instance will be created
  + resource "ibm_resource_instance" "cos_instance" {
      + account_id              = (known after apply)
      + allow_cleanup           = (known after apply)
      + created_at              = (known after apply)
      + created_by              = (known after apply)
      + crn                     = (known after apply)
      + dashboard_url           = (known after apply)
      + deleted_at              = (known after apply)
      + deleted_by              = (known after apply)
      + extensions              = (known after apply)
      + guid                    = (known after apply)
      + id                      = (known after apply)
      + last_operation          = (known after apply)
      + location                = "global"
      + locked                  = (known after apply)
      + name                    = "vpc-logs-cos"
      + plan                    = "standard"
      + plan_history            = (known after apply)
      + resource_aliases_url    = (known after apply)
      + resource_bindings_url   = (known after apply)
      + resource_controller_url = (known after apply)
      + resource_crn            = (known after apply)
      + resource_group_crn      = (known after apply)
      + resource_group_id       = (known after apply)
      + resource_group_name     = (known after apply)
      + resource_id             = (known after apply)
      + resource_keys_url       = (known after apply)
      + resource_name           = (known after apply)
      + resource_plan_id        = (known after apply)
      + resource_status         = (known after apply)
      + restored_at             = (known after apply)
      + restored_by             = (known after apply)
      + scheduled_reclaim_at    = (known after apply)
      + scheduled_reclaim_by    = (known after apply)
      + service                 = "cloud-object-storage"
      + service_endpoints       = (known after apply)
      + state                   = (known after apply)
      + status                  = (known after apply)
      + sub_type                = (known after apply)
      + tags                    = (known after apply)
      + target_crn              = (known after apply)
      + type                    = (known after apply)
      + update_at               = (known after apply)
      + update_by               = (known after apply)
    }

  # module.hub_vpc.data.ibm_is_vpc_address_prefixes.get_address_prefixes will be read during apply
  # (config refers to values not yet known)
 <= data "ibm_is_vpc_address_prefixes" "get_address_prefixes" {
      + address_prefixes = (known after apply)
      + id               = (known after apply)
      + vpc              = (known after apply)
    }

  # module.hub_vpc.ibm_dns_custom_resolver.custom_resolver_hub[0] will be created
  + resource "ibm_dns_custom_resolver" "custom_resolver_hub" {
      + created_on         = (known after apply)
      + custom_resolver_id = (known after apply)
      + enabled            = true
      + health             = (known after apply)
      + high_availability  = true
      + id                 = (known after apply)
      + instance_id        = (known after apply)
      + modified_on        = (known after apply)
      + name               = "dns-custom-resolver-name"
      + rules              = (known after apply)

      + locations {
          + dns_server_ip = (known after apply)
          + enabled       = true
          + healthy       = (known after apply)
          + location_id   = (known after apply)
          + subnet_crn    = (known after apply)
        }
      + locations {
          + dns_server_ip = (known after apply)
          + enabled       = true
          + healthy       = (known after apply)
          + location_id   = (known after apply)
          + subnet_crn    = (known after apply)
        }
      + locations {
          + dns_server_ip = (known after apply)
          + enabled       = true
          + healthy       = (known after apply)
          + location_id   = (known after apply)
          + subnet_crn    = (known after apply)
        }
    }

  # module.hub_vpc.ibm_is_flow_log.flow_logs[0] will be created
  + resource "ibm_is_flow_log" "flow_logs" {
      + access_tags             = (known after apply)
      + active                  = true
      + auto_delete             = (known after apply)
      + created_at              = (known after apply)
      + crn                     = (known after apply)
      + href                    = (known after apply)
      + id                      = (known after apply)
      + lifecycle_state         = (known after apply)
      + name                    = "vpc-flow-logs"
      + resource_controller_url = (known after apply)
      + resource_crn            = (known after apply)
      + resource_group          = (known after apply)
      + resource_group_name     = (known after apply)
      + resource_name           = (known after apply)
      + resource_status         = (known after apply)
      + storage_bucket          = "vpc-logs-cos-bucket"
      + tags                    = (known after apply)
      + target                  = (known after apply)
      + vpc                     = (known after apply)
    }

  # module.hub_vpc.ibm_is_network_acl.network_acl["vpc-acl"] will be created
  + resource "ibm_is_network_acl" "network_acl" {
      + access_tags             = (known after apply)
      + crn                     = (known after apply)
      + id                      = (known after apply)
      + name                    = "hub-vpc-acl"
      + resource_controller_url = (known after apply)
      + resource_crn            = (known after apply)
      + resource_group          = (known after apply)
      + resource_group_name     = (known after apply)
      + resource_name           = (known after apply)
      + tags                    = (known after apply)
      + vpc                     = (known after apply)
    }

  # module.hub_vpc.ibm_is_public_gateway.gateway["zone-1"] will be created
  + resource "ibm_is_public_gateway" "gateway" {
      + access_tags             = (known after apply)
      + crn                     = (known after apply)
      + floating_ip             = (known after apply)
      + id                      = (known after apply)
      + name                    = "public-gw-zone-1"
      + resource_controller_url = (known after apply)
      + resource_crn            = (known after apply)
      + resource_group          = (known after apply)
      + resource_group_name     = (known after apply)
      + resource_name           = (known after apply)
      + resource_status         = (known after apply)
      + status                  = (known after apply)
      + tags                    = (known after apply)
      + vpc                     = (known after apply)
      + zone                    = "us-south-1"
    }

  # module.hub_vpc.ibm_is_subnet.subnet["hub-subnet-a"] will be created
  + resource "ibm_is_subnet" "subnet" {
      + access_tags                  = (known after apply)
      + available_ipv4_address_count = (known after apply)
      + crn                          = (known after apply)
      + id                           = (known after apply)
      + ip_version                   = "ipv4"
      + ipv4_cidr_block              = "10.10.10.0/24"
      + name                         = "hub-subnet-a"
      + network_acl                  = (known after apply)
      + public_gateway               = (known after apply)
      + resource_controller_url      = (known after apply)
      + resource_crn                 = (known after apply)
      + resource_group               = (known after apply)
      + resource_group_name          = (known after apply)
      + resource_name                = (known after apply)
      + resource_status              = (known after apply)
      + routing_table                = (known after apply)
      + status                       = (known after apply)
      + tags                         = (known after apply)
      + total_ipv4_address_count     = (known after apply)
      + vpc                          = (known after apply)
      + zone                         = "us-south-1"
    }

  # module.hub_vpc.ibm_is_subnet.subnet["hub-subnet-b"] will be created
  + resource "ibm_is_subnet" "subnet" {
      + access_tags                  = (known after apply)
      + available_ipv4_address_count = (known after apply)
      + crn                          = (known after apply)
      + id                           = (known after apply)
      + ip_version                   = "ipv4"
      + ipv4_cidr_block              = "10.20.10.0/24"
      + name                         = "hub-subnet-b"
      + network_acl                  = (known after apply)
      + public_gateway               = (known after apply)
      + resource_controller_url      = (known after apply)
      + resource_crn                 = (known after apply)
      + resource_group               = (known after apply)
      + resource_group_name          = (known after apply)
      + resource_name                = (known after apply)
      + resource_status              = (known after apply)
      + routing_table                = (known after apply)
      + status                       = (known after apply)
      + tags                         = (known after apply)
      + total_ipv4_address_count     = (known after apply)
      + vpc                          = (known after apply)
      + zone                         = "us-south-2"
    }

  # module.hub_vpc.ibm_is_subnet.subnet["hub-subnet-c"] will be created
  + resource "ibm_is_subnet" "subnet" {
      + access_tags                  = (known after apply)
      + available_ipv4_address_count = (known after apply)
      + crn                          = (known after apply)
      + id                           = (known after apply)
      + ip_version                   = "ipv4"
      + ipv4_cidr_block              = "10.30.10.0/24"
      + name                         = "hub-subnet-c"
      + network_acl                  = (known after apply)
      + public_gateway               = (known after apply)
      + resource_controller_url      = (known after apply)
      + resource_crn                 = (known after apply)
      + resource_group               = (known after apply)
      + resource_group_name          = (known after apply)
      + resource_name                = (known after apply)
      + resource_status              = (known after apply)
      + routing_table                = (known after apply)
      + status                       = (known after apply)
      + tags                         = (known after apply)
      + total_ipv4_address_count     = (known after apply)
      + vpc                          = (known after apply)
      + zone                         = "us-south-3"
    }

  # module.hub_vpc.ibm_is_vpc.vpc[0] will be created
  + resource "ibm_is_vpc" "vpc" {
      + access_tags                 = (known after apply)
      + address_prefix_management   = "manual"
      + classic_access              = false
      + crn                         = (known after apply)
      + cse_source_addresses        = (known after apply)
      + default_network_acl         = (known after apply)
      + default_network_acl_crn     = (known after apply)
      + default_network_acl_name    = (known after apply)
      + default_routing_table       = (known after apply)
      + default_routing_table_name  = (known after apply)
      + default_security_group      = (known after apply)
      + default_security_group_crn  = (known after apply)
      + default_security_group_name = (known after apply)
      + health_reasons              = (known after apply)
      + health_state                = (known after apply)
      + id                          = (known after apply)
      + name                        = "hub"
      + no_sg_acl_rules             = false
      + resource_controller_url     = (known after apply)
      + resource_crn                = (known after apply)
      + resource_group              = (known after apply)
      + resource_group_name         = (known after apply)
      + resource_name               = (known after apply)
      + resource_status             = (known after apply)
      + security_group              = (known after apply)
      + status                      = (known after apply)
      + subnets                     = (known after apply)
      + tags                        = (known after apply)

      + dns {
          + enable_hub               = true
          + resolution_binding_count = (known after apply)
        }
    }

  # module.hub_vpc.ibm_is_vpc_address_prefix.subnet_prefix["hub-subnet-a"] will be created
  + resource "ibm_is_vpc_address_prefix" "subnet_prefix" {
      + address_prefix = (known after apply)
      + cidr           = "10.10.10.0/24"
      + has_subnets    = (known after apply)
      + id             = (known after apply)
      + is_default     = false
      + name           = "hub-subnet-a"
      + related_crn    = (known after apply)
      + vpc            = (known after apply)
      + zone           = "us-south-1"
    }

  # module.hub_vpc.ibm_is_vpc_address_prefix.subnet_prefix["hub-subnet-b"] will be created
  + resource "ibm_is_vpc_address_prefix" "subnet_prefix" {
      + address_prefix = (known after apply)
      + cidr           = "10.20.10.0/24"
      + has_subnets    = (known after apply)
      + id             = (known after apply)
      + is_default     = false
      + name           = "hub-subnet-b"
      + related_crn    = (known after apply)
      + vpc            = (known after apply)
      + zone           = "us-south-2"
    }

  # module.hub_vpc.ibm_is_vpc_address_prefix.subnet_prefix["hub-subnet-c"] will be created
  + resource "ibm_is_vpc_address_prefix" "subnet_prefix" {
      + address_prefix = (known after apply)
      + cidr           = "10.30.10.0/24"
      + has_subnets    = (known after apply)
      + id             = (known after apply)
      + is_default     = false
      + name           = "hub-subnet-c"
      + related_crn    = (known after apply)
      + vpc            = (known after apply)
      + zone           = "us-south-3"
    }

  # module.hub_vpc.ibm_resource_instance.dns_instance_hub[0] will be created
  + resource "ibm_resource_instance" "dns_instance_hub" {
      + account_id              = (known after apply)
      + allow_cleanup           = (known after apply)
      + created_at              = (known after apply)
      + created_by              = (known after apply)
      + crn                     = (known after apply)
      + dashboard_url           = (known after apply)
      + deleted_at              = (known after apply)
      + deleted_by              = (known after apply)
      + extensions              = (known after apply)
      + guid                    = (known after apply)
      + id                      = (known after apply)
      + last_operation          = (known after apply)
      + location                = "global"
      + locked                  = (known after apply)
      + name                    = "dns-instance-name"
      + plan                    = "standard-dns"
      + plan_history            = (known after apply)
      + resource_aliases_url    = (known after apply)
      + resource_bindings_url   = (known after apply)
      + resource_controller_url = (known after apply)
      + resource_crn            = (known after apply)
      + resource_group_crn      = (known after apply)
      + resource_group_id       = (known after apply)
      + resource_group_name     = (known after apply)
      + resource_id             = (known after apply)
      + resource_keys_url       = (known after apply)
      + resource_name           = (known after apply)
      + resource_plan_id        = (known after apply)
      + resource_status         = (known after apply)
      + restored_at             = (known after apply)
      + restored_by             = (known after apply)
      + scheduled_reclaim_at    = (known after apply)
      + scheduled_reclaim_by    = (known after apply)
      + service                 = "dns-svcs"
      + service_endpoints       = (known after apply)
      + state                   = (known after apply)
      + status                  = (known after apply)
      + sub_type                = (known after apply)
      + tags                    = (known after apply)
      + target_crn              = (known after apply)
      + type                    = (known after apply)
      + update_at               = (known after apply)
      + update_by               = (known after apply)
    }

  # module.resource_group.ibm_resource_group.resource_group[0] will be created
  + resource "ibm_resource_group" "resource_group" {
      + created_at          = (known after apply)
      + crn                 = (known after apply)
      + default             = (known after apply)
      + id                  = (known after apply)
      + name                = "hs-delegated-resource-group"
      + payment_methods_url = (known after apply)
      + quota_id            = (known after apply)
      + quota_url           = (known after apply)
      + resource_linkages   = (known after apply)
      + state               = (known after apply)
      + teams_url           = (known after apply)
      + updated_at          = (known after apply)
    }

  # module.spoke_vpc.data.ibm_is_vpc_address_prefixes.get_address_prefixes will be read during apply
  # (config refers to values not yet known)
 <= data "ibm_is_vpc_address_prefixes" "get_address_prefixes" {
      + address_prefixes = (known after apply)
      + id               = (known after apply)
      + vpc              = (known after apply)
    }

  # module.spoke_vpc.ibm_is_flow_log.flow_logs[0] will be created
  + resource "ibm_is_flow_log" "flow_logs" {
      + access_tags             = (known after apply)
      + active                  = true
      + auto_delete             = (known after apply)
      + created_at              = (known after apply)
      + crn                     = (known after apply)
      + href                    = (known after apply)
      + id                      = (known after apply)
      + lifecycle_state         = (known after apply)
      + name                    = "vpc-flow-logs"
      + resource_controller_url = (known after apply)
      + resource_crn            = (known after apply)
      + resource_group          = (known after apply)
      + resource_group_name     = (known after apply)
      + resource_name           = (known after apply)
      + resource_status         = (known after apply)
      + storage_bucket          = "vpc-logs-cos-bucket"
      + tags                    = (known after apply)
      + target                  = (known after apply)
      + vpc                     = (known after apply)
    }

  # module.spoke_vpc.ibm_is_network_acl.network_acl["vpc-acl"] will be created
  + resource "ibm_is_network_acl" "network_acl" {
      + access_tags             = (known after apply)
      + crn                     = (known after apply)
      + id                      = (known after apply)
      + name                    = "spoke-vpc-acl"
      + resource_controller_url = (known after apply)
      + resource_crn            = (known after apply)
      + resource_group          = (known after apply)
      + resource_group_name     = (known after apply)
      + resource_name           = (known after apply)
      + tags                    = (known after apply)
      + vpc                     = (known after apply)
    }

  # module.spoke_vpc.ibm_is_public_gateway.gateway["zone-1"] will be created
  + resource "ibm_is_public_gateway" "gateway" {
      + access_tags             = (known after apply)
      + crn                     = (known after apply)
      + floating_ip             = (known after apply)
      + id                      = (known after apply)
      + name                    = "public-gw-zone-1"
      + resource_controller_url = (known after apply)
      + resource_crn            = (known after apply)
      + resource_group          = (known after apply)
      + resource_group_name     = (known after apply)
      + resource_name           = (known after apply)
      + resource_status         = (known after apply)
      + status                  = (known after apply)
      + tags                    = (known after apply)
      + vpc                     = (known after apply)
      + zone                    = "us-south-1"
    }

  # module.spoke_vpc.ibm_is_subnet.subnet["spoke-subnet-a"] will be created
  + resource "ibm_is_subnet" "subnet" {
      + access_tags                  = (known after apply)
      + available_ipv4_address_count = (known after apply)
      + crn                          = (known after apply)
      + id                           = (known after apply)
      + ip_version                   = "ipv4"
      + ipv4_cidr_block              = "10.40.10.0/24"
      + name                         = "spoke-subnet-a"
      + network_acl                  = (known after apply)
      + public_gateway               = (known after apply)
      + resource_controller_url      = (known after apply)
      + resource_crn                 = (known after apply)
      + resource_group               = (known after apply)
      + resource_group_name          = (known after apply)
      + resource_name                = (known after apply)
      + resource_status              = (known after apply)
      + routing_table                = (known after apply)
      + status                       = (known after apply)
      + tags                         = (known after apply)
      + total_ipv4_address_count     = (known after apply)
      + vpc                          = (known after apply)
      + zone                         = "us-south-1"
    }

  # module.spoke_vpc.ibm_is_subnet.subnet["spoke-subnet-b"] will be created
  + resource "ibm_is_subnet" "subnet" {
      + access_tags                  = (known after apply)
      + available_ipv4_address_count = (known after apply)
      + crn                          = (known after apply)
      + id                           = (known after apply)
      + ip_version                   = "ipv4"
      + ipv4_cidr_block              = "10.50.10.0/24"
      + name                         = "spoke-subnet-b"
      + network_acl                  = (known after apply)
      + public_gateway               = (known after apply)
      + resource_controller_url      = (known after apply)
      + resource_crn                 = (known after apply)
      + resource_group               = (known after apply)
      + resource_group_name          = (known after apply)
      + resource_name                = (known after apply)
      + resource_status              = (known after apply)
      + routing_table                = (known after apply)
      + status                       = (known after apply)
      + tags                         = (known after apply)
      + total_ipv4_address_count     = (known after apply)
      + vpc                          = (known after apply)
      + zone                         = "us-south-2"
    }

  # module.spoke_vpc.ibm_is_subnet.subnet["spoke-subnet-c"] will be created
  + resource "ibm_is_subnet" "subnet" {
      + access_tags                  = (known after apply)
      + available_ipv4_address_count = (known after apply)
      + crn                          = (known after apply)
      + id                           = (known after apply)
      + ip_version                   = "ipv4"
      + ipv4_cidr_block              = "10.60.10.0/24"
      + name                         = "spoke-subnet-c"
      + network_acl                  = (known after apply)
      + public_gateway               = (known after apply)
      + resource_controller_url      = (known after apply)
      + resource_crn                 = (known after apply)
      + resource_group               = (known after apply)
      + resource_group_name          = (known after apply)
      + resource_name                = (known after apply)
      + resource_status              = (known after apply)
      + routing_table                = (known after apply)
      + status                       = (known after apply)
      + tags                         = (known after apply)
      + total_ipv4_address_count     = (known after apply)
      + vpc                          = (known after apply)
      + zone                         = "us-south-3"
    }

  # module.spoke_vpc.ibm_is_vpc.vpc[0] will be created
  + resource "ibm_is_vpc" "vpc" {
      + access_tags                 = (known after apply)
      + address_prefix_management   = "manual"
      + classic_access              = false
      + crn                         = (known after apply)
      + cse_source_addresses        = (known after apply)
      + default_network_acl         = (known after apply)
      + default_network_acl_crn     = (known after apply)
      + default_network_acl_name    = (known after apply)
      + default_routing_table       = (known after apply)
      + default_routing_table_name  = (known after apply)
      + default_security_group      = (known after apply)
      + default_security_group_crn  = (known after apply)
      + default_security_group_name = (known after apply)
      + health_reasons              = (known after apply)
      + health_state                = (known after apply)
      + id                          = (known after apply)
      + name                        = "spoke"
      + no_sg_acl_rules             = false
      + resource_controller_url     = (known after apply)
      + resource_crn                = (known after apply)
      + resource_group              = (known after apply)
      + resource_group_name         = (known after apply)
      + resource_name               = (known after apply)
      + resource_status             = (known after apply)
      + security_group              = (known after apply)
      + status                      = (known after apply)
      + subnets                     = (known after apply)
      + tags                        = (known after apply)

      + dns {
          + enable_hub               = false
          + resolution_binding_count = (known after apply)
        }
    }

  # module.spoke_vpc.ibm_is_vpc_address_prefix.subnet_prefix["spoke-subnet-a"] will be created
  + resource "ibm_is_vpc_address_prefix" "subnet_prefix" {
      + address_prefix = (known after apply)
      + cidr           = "10.40.10.0/24"
      + has_subnets    = (known after apply)
      + id             = (known after apply)
      + is_default     = false
      + name           = "spoke-subnet-a"
      + related_crn    = (known after apply)
      + vpc            = (known after apply)
      + zone           = "us-south-1"
    }

  # module.spoke_vpc.ibm_is_vpc_address_prefix.subnet_prefix["spoke-subnet-b"] will be created
  + resource "ibm_is_vpc_address_prefix" "subnet_prefix" {
      + address_prefix = (known after apply)
      + cidr           = "10.50.10.0/24"
      + has_subnets    = (known after apply)
      + id             = (known after apply)
      + is_default     = false
      + name           = "spoke-subnet-b"
      + related_crn    = (known after apply)
      + vpc            = (known after apply)
      + zone           = "us-south-2"
    }

  # module.spoke_vpc.ibm_is_vpc_address_prefix.subnet_prefix["spoke-subnet-c"] will be created
  + resource "ibm_is_vpc_address_prefix" "subnet_prefix" {
      + address_prefix = (known after apply)
      + cidr           = "10.60.10.0/24"
      + has_subnets    = (known after apply)
      + id             = (known after apply)
      + is_default     = false
      + name           = "spoke-subnet-c"
      + related_crn    = (known after apply)
      + vpc            = (known after apply)
      + zone           = "us-south-3"
    }

  # module.spoke_vpc.ibm_is_vpc_dns_resolution_binding.vpc_dns_resolution_binding_crn[0] will be created
  + resource "ibm_is_vpc_dns_resolution_binding" "vpc_dns_resolution_binding_crn" {
      + created_at        = (known after apply)
      + endpoint_gateways = (known after apply)
      + href              = (known after apply)
      + id                = (known after apply)
      + lifecycle_state   = (known after apply)
      + name              = "dns-binding-name"
      + resource_type     = (known after apply)
      + vpc_id            = (known after apply)

      + vpc {
          + crn           = (known after apply)
          + href          = (known after apply)
          + id            = (known after apply)
          + name          = (known after apply)
          + remote        = (known after apply)
          + resource_type = (known after apply)
        }
    }

  # module.tg_gateway_connection.ibm_tg_connection.vpc_connections[0] will be created
  + resource "ibm_tg_connection" "vpc_connections" {
      + base_connection_id = (known after apply)
      + base_network_type  = (known after apply)
      + connection_id      = (known after apply)
      + created_at         = (known after apply)
      + gateway            = (known after apply)
      + id                 = (known after apply)
      + local_gateway_ip   = (known after apply)
      + local_tunnel_ip    = (known after apply)
      + name               = "vpc_conn_inst0"
      + network_account_id = (known after apply)
      + network_id         = (known after apply)
      + network_type       = "vpc"
      + related_crn        = (known after apply)
      + remote_bgp_asn     = (known after apply)
      + remote_gateway_ip  = (known after apply)
      + remote_tunnel_ip   = (known after apply)
      + request_status     = (known after apply)
      + status             = (known after apply)
      + updated_at         = (known after apply)
      + zone               = (known after apply)
    }

  # module.tg_gateway_connection.ibm_tg_connection.vpc_connections[1] will be created
  + resource "ibm_tg_connection" "vpc_connections" {
      + base_connection_id = (known after apply)
      + base_network_type  = (known after apply)
      + connection_id      = (known after apply)
      + created_at         = (known after apply)
      + gateway            = (known after apply)
      + id                 = (known after apply)
      + local_gateway_ip   = (known after apply)
      + local_tunnel_ip    = (known after apply)
      + name               = "vpc_conn_inst1"
      + network_account_id = (known after apply)
      + network_id         = (known after apply)
      + network_type       = "vpc"
      + related_crn        = (known after apply)
      + remote_bgp_asn     = (known after apply)
      + remote_gateway_ip  = (known after apply)
      + remote_tunnel_ip   = (known after apply)
      + request_status     = (known after apply)
      + status             = (known after apply)
      + updated_at         = (known after apply)
      + zone               = (known after apply)
    }

  # module.tg_gateway_connection.ibm_tg_gateway.tg_gw_instance[0] will be created
  + resource "ibm_tg_gateway" "tg_gw_instance" {
      + created_at              = (known after apply)
      + crn                     = (known after apply)
      + global                  = false
      + id                      = (known after apply)
      + location                = "us-south"
      + name                    = "hs-delegated-tg"
      + resource_controller_url = (known after apply)
      + resource_crn            = (known after apply)
      + resource_group          = (known after apply)
      + resource_group_name     = (known after apply)
      + resource_name           = (known after apply)
      + resource_status         = (known after apply)
      + status                  = (known after apply)
      + tags                    = (known after apply)
      + updated_at              = (known after apply)

      + timeouts {
          + delete = "45m"
        }
    }

Plan: 29 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + custom_resolver_hub_vpc                = {
      + created_on         = (known after apply)
      + custom_resolver_id = (known after apply)
      + description        = null
      + enabled            = true
      + health             = (known after apply)
      + high_availability  = true
      + id                 = (known after apply)
      + instance_id        = (known after apply)
      + locations          = [
          + {
              + dns_server_ip = (known after apply)
              + enabled       = true
              + healthy       = (known after apply)
              + location_id   = (known after apply)
              + subnet_crn    = (known after apply)
            },
          + {
              + dns_server_ip = (known after apply)
              + enabled       = true
              + healthy       = (known after apply)
              + location_id   = (known after apply)
              + subnet_crn    = (known after apply)
            },
          + {
              + dns_server_ip = (known after apply)
              + enabled       = true
              + healthy       = (known after apply)
              + location_id   = (known after apply)
              + subnet_crn    = (known after apply)
            },
        ]
      + modified_on        = (known after apply)
      + name               = "dns-custom-resolver-name"
      + rules              = (known after apply)
      + timeouts           = null
    }
  + dns_endpoint_gateways_by_spoke_vpc_crn = {
      + created_at        = (known after apply)
      + endpoint_gateways = (known after apply)
      + href              = (known after apply)
      + id                = (known after apply)
      + lifecycle_state   = (known after apply)
      + name              = "dns-binding-name"
      + resource_type     = (known after apply)
      + vpc               = [
          + {
              + crn           = (known after apply)
              + href          = (known after apply)
              + id            = (known after apply)
              + name          = (known after apply)
              + remote        = (known after apply)
              + resource_type = (known after apply)
            },
        ]
      + vpc_id            = (known after apply)
    }
  + hub_vpc_crn                            = (known after apply)
  + hub_vpc_id                             = (known after apply)
  + spoke_vpc_crn                          = (known after apply)
  + spoke_vpc_id                           = (known after apply)
  + transit_gateway_crn                    = (known after apply)
  + transit_gateway_id                     = (known after apply)
  + vpc_connection_ids                     = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```